#Flag目前只有两个值,1为分区需要下载,0为不需要下载
#type目前有5种值,0x1=Vendor分区 0x2=IDBlock分区 0x4=Kernel分区 0x8=boot分区 0x80000000=普通分区
#PartSize和PartOffset字段的值都是以扇区为单位
[System]
FwVersion=16.12.23
#如果Nano=1,则生成nano的idblock
Nano=
#如果BLANK_GAP＝1,则生成的idblock按每2k数据间隔2k空白保存
BLANK_GAP=1
#FILL_BYTE表示分区尾部空白用什么数据填充，默认为0
FILL_BYTE=
[IDBlock]
Flag=1
DDR_Bin=RK3399_DDR_666M_V1.05.bin
Loader_Bin=rk3399miniloaderall_v1.05.bin
PartOffset=0x40
PartSize=0x780
[UserPart1]
Name=trust
Type=0x10
Flag=1
File=trust.img
PartOffset=0x800
PartSize=0x800
[UserPart2]
Name=uboot
Type=0x20
Flag=1
File=uboot.img
PartOffset=0x1000
PartSize=0x800


